import { Lib } from '../services/client.js';
import { Parame } from './config.js';

const dict = {
    Traditional: {},
    Simplified: {
        "📝 設置選單": "📝 设置菜单",
        "設置菜單": "设置菜单",
        "圖像設置": "图像设置",
        "讀取設定": "加载设置",
        "關閉離開": "关闭",
        "保存應用": "保存并应用",
        "語言": "语言",
        "英文": "英语",
        "繁體": "繁体中文",
        "簡體": "简体中文",
        "日文": "日语",
        "韓文": "韩语",
        "俄語": "俄语",
        "圖片高度": "图片高度",
        "圖片寬度": "图片宽度",
        "圖片最大寬度": "图片最大宽度",
        "圖片間隔高度": "图片间距"
    },
    Japan: {
        "📝 設置選單": "📝 設定メニュー",
        "設置菜單": "設定メニュー",
        "圖像設置": "画像設定",
        "讀取設定": "設定を読み込む",
        "關閉離開": "閉じる",
        "保存應用": "保存して適用",
        "語言": "言語",
        "英文": "英語",
        "繁體": "繁体字中国語",
        "簡體": "簡体字中国語",
        "日文": "日本語",
        "韓文": "韓国語",
        "俄語": "ロシア語",
        "圖片高度": "画像の高さ",
        "圖片寬度": "画像の幅",
        "圖片最大寬度": "画像の最大幅",
        "圖片間隔高度": "画像の間隔"
    },
    Korea: {
        "📝 設置選單": "📝 설정 메뉴",
        "設置菜單": "설정 메뉴",
        "圖像設置": "이미지 설정",
        "讀取設定": "설정 불러오기",
        "關閉離開": "닫기",
        "保存應用": "저장 및 적용",
        "語言": "언어",
        "英文": "영어",
        "繁體": "번체 중국어",
        "簡體": "간체 중국어",
        "日文": "일본어",
        "韓文": "한국어",
        "俄語": "러시아어",
        "圖片高度": "이미지 높이",
        "圖片寬度": "이미지 너비",
        "圖片最大寬度": "이미지 최대 너비",
        "圖片間隔高度": "이미지 간격"
    },
    Russia: {
        "📝 設置選單": "📝 Меню настроек",
        "設置菜單": "Меню настроек",
        "圖像設置": "Настройки изображений",
        "讀取設定": "Загрузить настройки",
        "關閉離開": "Закрыть",
        "保存應用": "Сохранить и применить",
        "語言": "Язык",
        "英文": "Английский",
        "繁體": "Традиционный китайский",
        "簡體": "Упрощенный китайский",
        "日文": "Японский",
        "韓文": "Корейский",
        "俄語": "Русский",
        "圖片高度": "Высота изображения",
        "圖片寬度": "Ширина изображения",
        "圖片最大寬度": "Максимальная ширина",
        "圖片間隔高度": "Интервал между изображениями"
    },
    English: {
        "📝 設置選單": "📝 Settings Menu",
        "設置菜單": "Settings Menu",
        "圖像設置": "Image Settings",
        "讀取設定": "Load Settings",
        "關閉離開": "Close & Exit",
        "保存應用": "Save & Apply",
        "語言": "Language",
        "英文": "English",
        "繁體": "Traditional Chinese",
        "簡體": "Simplified Chinese",
        "日文": "Japanese",
        "韓文": "Korean",
        "俄語": "Russian",
        "圖片高度": "Image Height",
        "圖片寬度": "Image Width",
        "圖片最大寬度": "Max Image Width",
        "圖片間隔高度": "Image Spacing"
    }
};

function getLanguage() {
    const Log = Lib.getV(Parame.SaveKey.Lang, navigator.language);
    const ML = Lib.translMatcher(dict, Log);

    return { Log, Transl: (str) => ML[str] ?? str }
};

export default getLanguage;